//
//  Terms.swift
//  geD
//
//  Created by 김민순 on 2021/06/05.
//

struct Terms {
    let titles = ["서비스 이용약관", "개인정보 이용약관", "위치정보 이용약관"]
    let contents = ["제1조 (목적)\n이 이용약관(이하 ‘약관’)은 게디(이하 ‘회사’)와 이용 고객(이하 ‘회원’)간에 회사가 제공하는 게디앱 서비스(이하 ‘서비스’)의 가입조건 및 이용에 관한 제반 사항과 기타 필요한 사항을 규정함을 목적으로 합니다.\n\n제2조 (이용약관의 효력 및 변경)\n1. 이 약관은 서비스를 이용하고 하는 모든 회원에 대하여 그 효력을 발생합니다.\n2. 이 약관은 게디앱에 공시됨으로써 효력이 발생되고, 합리적인 사유가 발생할 경우 회사는 관계법령에 위배되지 않는 범위에서 이 약관을 변경할 수 있습니다.\n3. 개정약관도 게디앱 사이트에 온라인으로 공시됨으로써 효력이 발생됩니다. 회사는 약관을 변경할 경우 지체 없이 이를 공시하여야 하고, 회원의 권리나 의무등에 관한 중요사항을 개정할 경우에는 사전에 공시하여야 합니다.\n4. 이 약관에 동의하는 것은 정기적으로 레핏앱 사이트를 방문하여 약관의제1조 (목적)\n이 이용약관(이하 ‘약관’)은 게디(이하 ‘회사’)와 이용 고객(이하 ‘회원’)간에 회사가 제공하는 게디앱 서비스(이하 ‘서비스’)의 가입조건 및 이용에 관한 제반 사항과 기타 필요한 사항을 규정함을 목적으로 합니다.\n\n제2조 (이용약관의 효력 및 변경)\n1. 이 약관은 서비스를 이용하고 하는 모든 회원에 대하여 그 효력을 발생합니다.\n2. 이 약관은 게디앱에 공시됨으로써 효력이 발생되고, 합리적인 사유가 발생할 경우 회사는 관계법령에 위배되지 않는 범위에서 이 약관을 변경할 있습니다.\n3. 개정약관도 게디앱 사이트에 온라인으로 공시됨으로써 효력이 발생됩니다. 회사는 약관을 변경할 경우 지체 없이 이를 공시하여야 하고, 회원의 권리나 의무등에 관한 중요사항을 개정할 경우에는 사전에 공시하여야 합니다.\n4. 이 약관에 동의하는 것은 정기적으로 레핏앱 사이트를 방문하여 약관의제1조 (목적)\n이 이용약관(이하 ‘약관’)은 게디(이하 ‘회사’)와 이용 고객(이하 ‘회원’)간에 회사가 제공하는 게디앱 서비스(이하 ‘서비스’)의 가입조건 및 이용에 관한 제반 사항과 기타 필요한 사항을 규정함을 목적으로 합니다.\n\n제2조 (이용약관의 효력 및 변경)\n1. 이 약관은 서비스를 이용하고 하는 모든 회원에 대하여 그 효력을 발생합니다.\n2. 이 약관은 게디앱에 공시됨으로써 효력이 발생되고, 합리적인 사유가 발생할 경우 회사는 관계법령에 위배되지 않는 범위에서 이 약관을 변경할 있습니다.\n3. 개정약관도 게디앱 사이트에 온라인으로 공시됨으로써 효력이 발생됩니다. 회사는 약관을 변경할 경우 지체 없이 이를 공시하여야 하고, 회원의 권리나 의무등에 관한 중요사항을 개정할 경우에는 사전에 공시하여야 합니다.\n4. 이 약관에 동의하는 것은 정기적으로 레핏앱 사이트를 방문하여 약관의",
                    "이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다. 이곳은 개인정보 이용약관 입니다.",
                    "이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다. 이곳은 위치정보 이용약관 입니다."]
}
